In [3]:
import sqlite3

In [4]:
import pandas as pd

In [5]:
db = sqlite3.connect("/home/niraj/Downloads/hubway.db")

In [6]:
def run_query(query):
    return pd.read_sql_query(query,db)

In [10]:
query = 'SELECT * FROM trips LIMIT 5;'
run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,1,9,2011-07-28 10:12:00,23,2011-07-28 10:12:00,23,B00468,Registered,'97217,1976.0,Male
1,2,220,2011-07-28 10:21:00,23,2011-07-28 10:25:00,23,B00554,Registered,'02215,1966.0,Male
2,3,56,2011-07-28 10:33:00,23,2011-07-28 10:34:00,23,B00456,Registered,'02108,1943.0,Male
3,4,64,2011-07-28 10:35:00,23,2011-07-28 10:36:00,23,B00554,Registered,'02116,1981.0,Female
4,5,12,2011-07-28 10:37:00,23,2011-07-28 10:37:00,23,B00554,Registered,'97214,1983.0,Female

In [11]:
query = 'SELECT duration, start_date FROM trips LIMIT 5'
run_query(query)

   duration           start_date
0         9  2011-07-28 10:12:00
1       220  2011-07-28 10:21:00
2        56  2011-07-28 10:33:00
3        64  2011-07-28 10:35:00
4        12  2011-07-28 10:37:00

In [12]:
query = '''
SELECT duration 
FROM trips
ORDER BY duration DESC
LIMIT 1;
'''

run_query(query)

   duration
0      9999

In [14]:
query = '''
SELECT *
FROM trips
ORDER BY duration DESC
LIMIT 10;
'''

run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,541247,9999,2012-09-26 18:34:00,54,2012-09-26 21:21:00,54,T01078,Casual,,,
1,11341,9998,2011-08-09 10:42:00,40,2011-08-09 13:29:00,42,B00513,Casual,,,
2,416523,9998,2012-08-15 12:11:00,54,2012-08-15 14:58:00,80,B00188,Casual,,,
3,89335,9997,2011-10-09 02:30:00,60,2011-10-09 05:17:00,45,B00047,Casual,,,
4,133967,9996,2011-11-19 13:48:00,4,2011-11-19 16:35:00,58,B00238,Casual,,,
5,147451,9996,2012-03-23 14:48:00,35,2012-03-23 17:35:00,33,B00550,Casual,,,
6,24455,9995,2011-08-20 12:20:00,52,2011-08-20 15:07:00,17,B00552,Casual,,,
7,315737,9995,2012-07-03 18:28:00,12,2012-07-03 21:15:00,12,B00250,Registered,'02120,1964,Male
8,4768,9994,2011-08-03 17:16:00,22,2011-08-03 20:03:00,24,B00002,Casual,,,
9,55771,9994,2011-09-14 15:44:00,40,2011-09-14 18:30:00,40,B00139,Casual,,,

In [15]:
query = '''
SELECT * 
FROM trips
WHERE duration > 9990;
'''

run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,4768,9994,2011-08-03 17:16:00,22,2011-08-03 20:03:00,24,B00002,Casual,,,
1,8448,9991,2011-08-06 13:02:00,52,2011-08-06 15:48:00,24,B00174,Casual,,,
2,11341,9998,2011-08-09 10:42:00,40,2011-08-09 13:29:00,42,B00513,Casual,,,
3,24455,9995,2011-08-20 12:20:00,52,2011-08-20 15:07:00,17,B00552,Casual,,,
4,55771,9994,2011-09-14 15:44:00,40,2011-09-14 18:30:00,40,B00139,Casual,,,
5,81191,9993,2011-10-03 11:30:00,22,2011-10-03 14:16:00,36,B00474,Casual,,,
6,89335,9997,2011-10-09 02:30:00,60,2011-10-09 05:17:00,45,B00047,Casual,,,
7,124500,9992,2011-11-09 09:08:00,22,2011-11-09 11:55:00,40,B00387,Casual,,,
8,133967,9996,2011-11-19 13:48:00,4,2011-11-19 16:35:00,58,B00238,Casual,,,
9,147451,9996,2012-03-23 14:48:00,35,2012-03-23 17:35:00,33,B00550,Casual,,,
10,315737,9995,2012-07-03 18:28:00,12,2012-07-03 21:15:00,12,B00250,Registered,'02120,1964,Male
11,319597,9994,2012-07-05 11:49:00,52,2012-07-05 14:35:00,55,B00237,Casual,,,
12,416523,9998,2012-08-15 12:11:00,54,2012-08-15 14:58:00,80,B00188,Casual,,,
13,541247,9999,2012-09-26 18:34:00,54,2012-09-26 21:21:00,54,T01078,Casual,,,

In [16]:
query = '''
SELECT * 
FROM trips
WHERE (duration >= 9990) AND (sub_type = "Registered")
ORDER BY duration DESC;
'''

run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,315737,9995,2012-07-03 18:28:00,12,2012-07-03 21:15:00,12,B00250,Registered,'02120,1964.0,Male

In [18]:
query='''
SELECT COUNT(*) FROM trips where sub_type="Registered"
'''
run_query(query)

   COUNT(*)
0   1105192

In [19]:
query='''
SELECT COUNT(*) AS "Total trips by registered users"
FROM trips where sub_type="Registered"
'''
run_query(query)

   Total trips by registered users
0                          1105192

In [22]:
query = '''
SELECT AVG(duration) as "Average Duration" from trips'''

run_query(query)

   Average Duration
0        912.409682

In [24]:
query='''
SELECT sub_type,avg(duration) as "Average Duration"
from trips group by sub_type
'''

run_query(query)

     sub_type  Average Duration
0      Casual       1519.643897
1  Registered        657.026067

In [26]:
query='''
SELeCT bike_number , count(*) as "Number of trips" from trips
group by bike_number
order by count(*) desc
limit 1'''

run_query(query)

  bike_number  Number of trips
0      B00490             2120

In [27]:
query = '''
SELECT avg(duration) as "Average Duration"
from trips
where (2017 - birth_date) > 30
'''

run_query(query)

   Average Duration
0        923.014685

In [28]:
query = '''
SELECT *
FROM stations
LIMIT 5;
'''
run_query(query)

,id,station,municipality,lat,lng
0,3,Colleges of the Fenway,Boston,42.340021,-71.100812
1,4,Tremont St. at Berkeley St.,Boston,42.345392,-71.069616
2,5,Northeastern U / North Parking Lot,Boston,42.341814,-71.090179
3,6,Cambridge St. at Joy St.,Boston,42.361284999999995,-71.06514
4,7,Fan Pier,Boston,42.353412,-71.044624

In [31]:
query='''
select stations.station, count(*) as "count of start station" from
trips join stations
on trips.start_station = stations.id
group by stations.station
order by count(*) desc
limit 5;'''
run_query(query)

                                         station  count of start station
0              South Station - 700 Atlantic Ave.                   56123
1       Boston Public Library - 700 Boylston St.                   41994
2  Charles Circle - Charles St. at Cambridge St.                   35984
3                           Beacon St / Mass Ave                   35275
4                   MIT at Mass Ave / Amherst St                   33644

In [33]:
query='''
select stations.station, count(*) as "count of round trips" from
trips join stations
on trips.start_station = stations.station
where trips.end_station = trips.start_station
group by stations.station
order by count(*) desc
limit 5;'''
run_query(query)

                                         station  count of round trips
0    The Esplanade - Beacon St. at Arlington St.                  3064
1  Charles Circle - Charles St. at Cambridge St.                  2739
2       Boston Public Library - 700 Boylston St.                  2548
3                  Boylston St. at Arlington St.                  2163
4                           Beacon St / Mass Ave                  2144

In [44]:
query = '''
select count(*) as "Count"
from trips join stations s1 
on s1.id = trips.start_station
join stations s2
on s2.id = trips.end_station
where s1.municipality <> s2.municipality
'''

run_query(query)

    Count
0  309748

In [45]:
query='''
select count(*) from trips where duration > 1800'''
run_query(query)

   count(*)
0    123155

In [51]:
query = '''
select bike_number,duration from trips
where duration in (select max(duration) from trips)
'''
run_query(query)

  bike_number  duration
0      T01078      9999

In [54]:
query='''
select sub_type,count(*) as "Count"
from trips
where trips.end_station = trips.start_station
group by sub_type'''
run_query(query)

     sub_type  Count
0      Casual  41427
1  Registered  31641

In [63]:
query = '''
select stations.municipality,avg(trips.duration) as "Average Duration"
from trips join stations 
on (trips.start_station = stations.id
and trips.end_station = stations.id)
or
(trips.start_station = stations.id)
or
(trips.end_station=stations.id)
group by 1
order by 2 desc
'''

run_query(query)

  municipality  Average Duration
0    Brookline       1025.802670
1       Boston        896.866636
2   Somerville        845.710733
3    Cambridge        826.447719